"""Даны действительные числа А, В, С- стороны треугольника, найти его периметр.
"""
A, B, C = int(input()), int(input()), int(input())
P = A + B + C
print(f"Периметр треугольника равен: {P}")