"""Дана длина ребра куба. Найти объем куба и площадь его боковой поверхности."""
a = int(input("Введите длину ребра куба:"))
print(f"Объем куба равен: {a**3}")
print(f"Площадь боковой поверхности куба: {4*a**2}")


