""" Дана сторона равностороннего треугольника. Найти площадь этого треугольника.
"""
a = int(input("Введите сторону равностороннего треугольника:"))
print(f"Площадь равностороннего треугольника: {((3 ** 0.5) * (a ** 2)) / 4}")